<a href="https://colab.research.google.com/github/19pa1a0210/AI-assignment/blob/master/Untitled4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Experiment-2

PANDAS

In [ ]:
import numpy as np
import pandas as pd

1)Creating dataframe manually

In [ ]:
data = {'Roll No':['210','224','227'],'Name':['suma','veneela','swathi']}
df = pd.DataFrame(data=data)
df

  Roll No     Name
0     210     suma
1     224  veneela
2     227   swathi

2)Import data into dataframe

In [ ]:
df=pd.read_csv("students_placement_data.csv")
df.head

<bound method NDFrame.head of      Roll No Gender  ... registered_for_ Placement_Training  placement status
0          1      M  ...                                 NO        Not placed
1          2      F  ...                                yes            Placed
2          3      F  ...                                yes        Not placed
3          4      M  ...                                yes        Not placed
4          5      M  ...                                yes        Not placed
..       ...    ...  ...                                ...               ...
112      113      M  ...                                 NO        Not placed
113      114      M  ...                                 NO        Not placed
114      115      M  ...                                 NO        Not placed
115      116      M  ...                                 NO        Not placed
116      117      M  ...                                 NO        Not placed

[117 rows x 9 columns]>

In [ ]:
df.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [ ]:
df.shape

(117, 9)

In [ ]:
df.describe

<bound method NDFrame.describe of      Roll No Gender  ... registered_for_ Placement_Training  placement status
0          1      M  ...                                 NO        Not placed
1          2      F  ...                                yes            Placed
2          3      F  ...                                yes        Not placed
3          4      M  ...                                yes        Not placed
4          5      M  ...                                yes        Not placed
..       ...    ...  ...                                ...               ...
112      113      M  ...                                 NO        Not placed
113      114      M  ...                                 NO        Not placed
114      115      M  ...                                 NO        Not placed
115      116      M  ...                                 NO        Not placed
116      117      M  ...                                 NO        Not placed

[117 rows x 9 columns]>

3)Adding,deleting,modifying rows and coloumns in dataframe

In [ ]:
host_day = pd.read_csv("hostlers_day_scholars.csv")

In [ ]:
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [ ]:
df["hostlers/days scholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostlers/days scholar
0        1      M  ...       Not placed                      d
1        2      F  ...           Placed                      d
2        3      F  ...       Not placed                      d
3        4      M  ...       Not placed                      d
4        5      M  ...       Not placed                      h

[5 rows x 10 columns]

3.2)Deleting a coloumn

In [ ]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

3.3)Adding a row

In [ ]:
df1 = pd.DataFrame({"Rollno":[210],"Gender":["F"],"Section":["A"],"SSC Percentage":["10"],"inter_Diploma_percentage":["97"],"B.Tech_percentage":["75"],"Backlogs":["0"],"registered_for_Placement_Training":["Not applicable"],"hostler/day's scholar":["hostler"],"placement_status":["Not placed"]})
df1

   Rollno Gender  ... hostler/day's scholar placement_status
0     210      F  ...               hostler       Not placed

[1 rows x 10 columns]

In [ ]:
df = df.append(df1)
df.head()

   Roll No Gender  ... hostler/day's scholar placement_status
0      1.0      M  ...                   NaN              NaN
1      2.0      F  ...                   NaN              NaN
2      3.0      F  ...                   NaN              NaN
3      4.0      M  ...                   NaN              NaN
4      5.0      M  ...                   NaN              NaN

[5 rows x 13 columns]

In [ ]:
df=df.drop(3)
df.head()

   Roll No Gender  ... hostler/day's scholar placement_status
0      1.0      M  ...                   NaN              NaN
1      2.0      F  ...                   NaN              NaN
2      3.0      F  ...                   NaN              NaN
4      5.0      M  ...                   NaN              NaN
5      6.0      M  ...                   NaN              NaN

[5 rows x 13 columns]

3.5)modifying elements

In [ ]:
df.loc[1,"hostlers/days scholars"] = "hostler"
df.head

<bound method NDFrame.head of      Roll No Gender  ... placement_status hostlers/days scholars
0        1.0      M  ...              NaN                    NaN
1        2.0      F  ...              NaN                hostler
2        3.0      F  ...              NaN                    NaN
4        5.0      M  ...              NaN                    NaN
5        6.0      M  ...              NaN                    NaN
..       ...    ...  ...              ...                    ...
113    114.0      M  ...              NaN                    NaN
114    115.0      M  ...              NaN                    NaN
115    116.0      M  ...              NaN                    NaN
116    117.0      M  ...              NaN                    NaN
0        NaN      F  ...       Not placed                    NaN

[117 rows x 14 columns]>

4)Applying Functions on dataframes

In [ ]:
 def gracep(x):
  if ('x<70'):
     return ('x+0.05')
  else:
     return (x)

In [ ]:
df["B.Tech_percentage"]=df['B.Tech_percentage'].apply(gracep)
df.head()

   Roll No Gender  ... placement_status hostlers/days scholars
0      1.0      M  ...              NaN                    NaN
1      2.0      F  ...              NaN                hostler
2      3.0      F  ...              NaN                    NaN
4      5.0      M  ...              NaN                    NaN
5      6.0      M  ...              NaN                    NaN

[5 rows x 14 columns]

5)iterations on dataframes

In [ ]:
for index,row in df[df["B.Tech_percentage"]>='80'].iterrows():
    print(row["Roll No"],"-",row["B.Tech_percentage"])

1.0 - x+0.05
2.0 - x+0.05
3.0 - x+0.05
5.0 - x+0.05
6.0 - x+0.05
7.0 - x+0.05
8.0 - x+0.05
9.0 - x+0.05
10.0 - x+0.05
11.0 - x+0.05
12.0 - x+0.05
13.0 - x+0.05
14.0 - x+0.05
15.0 - x+0.05
16.0 - x+0.05
17.0 - x+0.05
18.0 - x+0.05
19.0 - x+0.05
20.0 - x+0.05
21.0 - x+0.05
22.0 - x+0.05
23.0 - x+0.05
24.0 - x+0.05
25.0 - x+0.05
26.0 - x+0.05
27.0 - x+0.05
28.0 - x+0.05
29.0 - x+0.05
30.0 - x+0.05
31.0 - x+0.05
32.0 - x+0.05
33.0 - x+0.05
34.0 - x+0.05
35.0 - x+0.05
36.0 - x+0.05
37.0 - x+0.05
38.0 - x+0.05
39.0 - x+0.05
40.0 - x+0.05
41.0 - x+0.05
42.0 - x+0.05
43.0 - x+0.05
44.0 - x+0.05
45.0 - x+0.05
46.0 - x+0.05
47.0 - x+0.05
48.0 - x+0.05
49.0 - x+0.05
50.0 - x+0.05
51.0 - x+0.05
52.0 - x+0.05
53.0 - x+0.05
54.0 - x+0.05
55.0 - x+0.05
56.0 - x+0.05
57.0 - x+0.05
58.0 - x+0.05
59.0 - x+0.05
60.0 - x+0.05
61.0 - x+0.05
62.0 - x+0.05
63.0 - x+0.05
64.0 - x+0.05
65.0 - x+0.05
66.0 - x+0.05
67.0 - x+0.05
68.0 - x+0.05
69.0 - x+0.05
70.0 - x+0.05
71.0 - x+0.05
72.0 - x+0.05
73.0 - x+0.05
74.0 - x+0.05
75.0 - x+0.05
76.0 - x+0.05
77.0 - x+0.05
78.0 - x+0.05
79.0 - x+0.05
80.0 - x+0.05
81.0 - x+0.05
82.0 - x+0.05
83.0 - x+0.05
84.0 - x+0.05
85.0 - x+0.05
86.0 - x+0.05
87.0 - x+0.05
88.0 - x+0.05
89.0 - x+0.05
90.0 - x+0.05
91.0 - x+0.05
92.0 - x+0.05
93.0 - x+0.05
94.0 - x+0.05
95.0 - x+0.05
96.0 - x+0.05
97.0 - x+0.05
98.0 - x+0.05
99.0 - x+0.05
100.0 - x+0.05
101.0 - x+0.05
102.0 - x+0.05
103.0 - x+0.05
104.0 - x+0.05
105.0 - x+0.05
106.0 - x+0.05
107.0 - x+0.05
108.0 - x+0.05
109.0 - x+0.05
110.0 - x+0.05
111.0 - x+0.05
112.0 - x+0.05
113.0 - x+0.05
114.0 - x+0.05
115.0 - x+0.05
116.0 - x+0.05
117.0 - x+0.05
nan - x+0.05

6)Accessing elements from dataframes

In [ ]:
df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

  SSC Percentage inter_Diploma_percentage
1             89                     92.4
2             67                       68

7)different ways to deal with na's in dataframe

In [ ]:
df["SSC Percentage"]=df["SSC Percentage"].replace('to_replace=np.nan,value=np.mean(df["SSC Percentage"])')
df.head()

   Roll No Gender  ... placement_status hostlers/days scholars
0      1.0      M  ...              NaN                    NaN
1      2.0      F  ...              NaN                hostler
2      3.0      F  ...              NaN                    NaN
4      5.0      M  ...              NaN                    NaN
5      6.0      M  ...              NaN                    NaN

[5 rows x 14 columns]

8)Group by operations on dataframes

In [184]:
group = df.groupby("Gender")
group["B.Tech_percentage"].agg
(np.mean)

9)Merging the dataframes

In [181]:
df2 = pd.read_csv('urban_rural.csv')
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [183]:
df = pd.merge(df,df2,on = "Roll No")
df.head()

   Roll No Gender Section  ... hostlers/days scholars Urban/Rural_x Urban/Rural_y
0      1.0      M       A  ...                    NaN         Urban         Urban
1      2.0      F       A  ...                hostler         Rural         Rural
2      3.0      F       A  ...                    NaN         Urban         Urban
3      5.0      M       A  ...                    NaN         Urban         Urban
4      6.0      M       A  ...                    NaN         Rural         Rural

[5 rows x 16 columns]